planet_server/app/controllers/planets_controller.rb

SELECT "planets".* FROM "planets"
---
  def index
    planets = Planet.all

INSERT INTO "planets" ("name", "num_moons", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "saturn"], ["num_moons", 4], ["color", "orange"], ["created_at", "2018-12-20 20:18:31.975196"], ["updated_at", "2018-12-20 20:18:31.975196"]]
---
  def create
    planet = Planet.create! planet_params

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "planets" SET "name" = $1, "num_moons" = $2, "color" = $3, "updated_at" = $4 WHERE "planets"."id" = $5  [["name", "jupiter"], ["num_moons", 64], ["color", "orange"], ["updated_at", "2018-12-20 20:29:12.330658"], ["id", 3]]
---
  def update
    planet = Planet.find(params["id"])
    planet.update! planet_params

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = $1  [["id", 2]]
---
  def destroy
    planet = Planet.find(params["id"])
    planet.destroy!